In [1]:
import pandas as pd

In [4]:
#dictionary ke dataframe
companies = {
    'id' : range(1, 6),
    'name' : ['grab', 'traveloka', 'telkom', 'bank indonesia', 'gits'],
    'location' : ['jakarta', 'tangerang', 'bandung', 'jakarta', 'jakarta']
}

companies_df = pd.DataFrame(companies)
companies_df

   id            name   location
0   1            grab    jakarta
1   2       traveloka  tangerang
2   3          telkom    bandung
3   4  bank indonesia    jakarta
4   5            gits    jakarta

In [7]:
#pandas series == sama dengan 1 kolom dalam sebuah tabel

employees = [5000, 7865, 5643, 9998, 7000]
employees_series = pd.Series(employees)
print(employees)
print(employees_series)

[5000, 7865, 5643, 9998, 7000]
0    5000
1    7865
2    5643
3    9998
4    7000
dtype: int64

In [ ]:
#pandas read file
#read_csv